test/request-response-samples/GetAccountXml__non_xmlns_attributes_should_be_returned/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:tns="#Foo" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"><soap:Header></soap:Header><soap:Body><tns:GetAccountXml xmlns:tns="#Foo" xmlns="#Foo"><tns:ResourceID>234</tns:ResourceID><tns:ResourceType>foo</tns:ResourceType><tns:IDType>more foo</tns:IDType><tns:TreeID>43</tns:TreeID><tns:PrivateLabelID>34</tns:PrivateLabelID></tns:GetAccountXml></soap:Body></soap:Envelope>